QA output created by 274
=== Install broken namespace ===
dbpmda> open pipe pmdas/broken/broken_pmda_2_0 -D47104 -l logfile
Start broken_pmda_2_0 PMDA: ./pmdas/broken/broken_pmda_2_0 -D47104 -l logfile
dbpmda> status

Namespace:              (default)
PMDA:                   ./pmdas/broken/broken_pmda_2_0
Connection:             daemon
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> # Test the valid metrics
dbpmda> fetch broken.valid.one broken.valid.two broken.valid.three
PMID(s): 249.0.0 249.0.1 249.0.7
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 3
  249.0.0 (broken.valid.one): numval: 1 valfmt: 0 vlist[]:
   value 1 REAL 0x1
  249.0.1 (broken.valid.two): numval: 3 valfmt: 0 vlist[]:
    inst [0 or ???] value 1 REAL 0x1
    inst [1 or ???] value 2 REAL 0x2
    inst [2 or ???] value 3 REAL 0x3
  249.0.7 (broken.valid.three): numval: 3 valfmt: 0 vlist[]:
    inst [50 or ???] value 44 REAL 0x2c
    inst [10 or ???] value 45 REAL 0x2d
    inst [9 or ???] value 46 REAL 0x2e
dbpmda> text broken.valid.one
PMID: 249.0.0
[calls to fetch callback]
The number of calls to the PMDA-supplied fetch callback function.
dbpmda> # Test for metric not defined in table but in the PMNS and fetch callback
dbpmda> fetch broken.bogus.one
PMID(s): 249.0.2
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.0.2 (broken.bogus.one): Unknown or illegal metric identifier
dbpmda> # Test for metric not defined in table and PMNS but in the fetch callback
dbpmda> fetch broken.bogus.two
                             ^ at or near here
Error: Unknown metric name
Type 'help' for a list of commands.
dbpmda> # Test for metric defined in table and fetch, but not the pmns
dbpmda> fetch broken.no.pmns
                           ^ at or near here
Error: Unknown metric name
Type 'help' for a list of commands.
dbpmda> # Test for multiple fetch with an invalid metric between valid metrics
dbpmda> fetch broken.valid.one broken.bogus.one broken.valid.two
PMID(s): 249.0.0 249.0.2 249.0.1
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 3
  249.0.0 (broken.valid.one): numval: 1 valfmt: 0 vlist[]:
   value 2 REAL 0x2
  249.0.2 (broken.bogus.one): Unknown or illegal metric identifier
  249.0.1 (broken.valid.two): numval: 3 valfmt: 0 vlist[]:
    inst [0 or ???] value 1 REAL 0x1
    inst [1 or ???] value 2 REAL 0x2
    inst [2 or ???] value 3 REAL 0x3
dbpmda> # Test for illegal data types
dbpmda> fetch broken.bad.type
PMID(s): 249.0.5
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.0.5 (broken.bad.type): Unknown or illegal metric type
dbpmda> # Test for metric with no fetch support
dbpmda> fetch broken.no.fetch
PMID(s): 249.0.9
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.0.9 (broken.no.fetch): Unknown or illegal metric identifier
dbpmda> # Test for metric with no help
dbpmda> fetch broken.no.help broken.no.shorthelp broken.no.longhelp
PMID(s): 249.0.10 249.0.11 249.0.12
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 3
  249.0.10 (broken.no.help): numval: 1 valfmt: 0 vlist[]:
   value 55 REAL 0x37
  249.0.11 (broken.no.shorthelp): numval: 1 valfmt: 0 vlist[]:
   value 66 REAL 0x42
  249.0.12 (broken.no.longhelp): numval: 1 valfmt: 0 vlist[]:
   value 77 REAL 0x4d
dbpmda> text broken.no.help
PMID: 249.0.10
Error PDU: Oneline or help text is not available
Error PDU: Oneline or help text is not available
dbpmda> text broken.no.shorthelp
PMID: 249.0.11
[<no one line help text specified>]
There is no short help for the metric
dbpmda> text broken.no.longhelp
PMID: 249.0.12
[no long help]
<no help text specified>
dbpmda> # Test for handling of bad semantics
dbpmda> fetch broken.bad.semantics
PMID(s): 249.1.1
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.1.1 (broken.bad.semantics): numval: 1 valfmt: 0 vlist[]:
   value 333 REAL 0x14d
dbpmda> # Test for handling of bad scale
dbpmda> fetch broken.bad.scale
PMID(s): 249.1.2
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.1.2 (broken.bad.scale): numval: 1 valfmt: 0 vlist[]:
   value 12345 REAL 0x3039
dbpmda> # Test for handling of empty instance lists
dbpmda> fetch broken.no.instances
PMID(s): 249.0.14
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.0.14 (broken.no.instances): No values returned!
dbpmda> # Test for handling of missing instances in fetch
dbpmda> fetch broken.no.instfetch
PMID(s): 249.0.13
pmResult dump from ADDR timestamp: EPOCH in LOCALTIME numpmid: 1
  249.0.13 (broken.no.instfetch): numval: 2 valfmt: 0 vlist[]:
    inst [50 or ???] value 44 REAL 0x2c
    inst [9 or ???] value 46 REAL 0x2e
dbpmda> close
dbpmda> quit
Log started

broken pmda Debug: pmdaInit: PMDA broken_pmda_2_0: Metric 0.0.1(1) matched to indom 249.0(0)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_0: Metric 0.0.7(3) matched to indom 249.7(1)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_0: Metric 0.0.13(8) matched to indom 249.7(1)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_0: Metric 0.0.14(12) matched to indom 249.8(2)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_0: help file pmdas/broken/broken_v2 opened
broken pmda Warning: pmdaDirect: PMDA broken_pmda_2_0: Direct mapping for metrics disabled @ metrics[2] 249.0.5
broken pmda Info: name        = broken_pmda_2_0
broken pmda Info: domain      = 249
broken pmda Info: ext flags  = 4
broken pmda Info: num metrics = 13
broken pmda Info: num indom   = 3
broken pmda Debug: pmdaConnect: PMDA broken_pmda_2_0: opened pipe to pmcd, infd = 0, outfd = 1
broken pmda Debug: Received PDU_PROFILE
broken pmda Debug: Received PDU_FETCH
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_FETCH
broken pmda Error: pmdaDesc: Requested metric 249.0.2 is not defined
broken pmda Error: pmdaFetch: Requested metric 249.0.2 is not defined
broken pmda Debug: Received PDU_FETCH
broken pmda Error: pmdaDesc: Requested metric 249.0.2 is not defined
broken pmda Error: pmdaFetch: Requested metric 249.0.2 is not defined
broken pmda Debug: Received PDU_FETCH
broken pmda Error: pmdaFetch: Descriptor type (Not Supported) for metric 249.0.5 is bad
broken pmda Debug: Received PDU_FETCH
broken pmda Error: pmdaFetch: PMID 249.0.9 not handled by fetch callback
broken pmda Debug: Received PDU_FETCH
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_FETCH
broken pmda Debug: Received PDU_FETCH
broken pmda Debug: Received PDU_FETCH
broken pmda Debug: Received PDU_FETCH
broken pmda Error: pmdaFetch: Instance 10 of PMID 249.0.13 not handled by fetch callback

Log finished
dbpmda> open pipe pmdas/broken/broken_pmda_2_1 -D47104 -l logfile
Start broken_pmda_2_1 PMDA: ./pmdas/broken/broken_pmda_2_1 -D47104 -l logfile
dbpmda> status

Namespace:              (default)
PMDA:                   ./pmdas/broken/broken_pmda_2_1
Connection:             daemon
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> wait 5
dbpmda> fetch broken.bad.indom
PMID(s): 249.1.4
Error: __pmSendProfile() failed: [PMDA died]
dbpmda> close
dbpmda> quit
Log started

broken pmda Debug: pmdaInit: PMDA broken_pmda_2_1: Metric 0.0.1(1) matched to indom 249.0(0)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_1: Metric 0.0.7(3) matched to indom 249.7(1)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_1: Metric 0.0.13(8) matched to indom 249.7(1)
broken pmda Critical: pmdaInit: PMDA broken_pmda_2_1: Undefined instance domain serial (17) specified in metric 0.1.4(12)
broken pmda Debug: pmdaConnect: PMDA broken_pmda_2_1: opened pipe to pmcd, infd = 0, outfd = 1
broken pmda Error: PMDA Initialisation Failed

Log finished
dbpmda> open pipe pmdas/broken/broken_pmda_2_2 -D47104 -l logfile
Start broken_pmda_2_2 PMDA: ./pmdas/broken/broken_pmda_2_2 -D47104 -l logfile
dbpmda> status

Namespace:              (default)
PMDA:                   ./pmdas/broken/broken_pmda_2_2
Connection:             daemon
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> close
dbpmda> quit
Log started

broken pmda Critical: pmdaInit: PMDA broken_pmda_2_2: Undefined instance domain serial (0) specified in metric 0.0.1(1)
broken pmda Debug: pmdaConnect: PMDA broken_pmda_2_2: opened pipe to pmcd, infd = 0, outfd = 1
broken pmda Error: PMDA Initialisation Failed

Log finished
dbpmda> open pipe pmdas/broken/broken_pmda_2_3 -D47104 -l logfile
Start broken_pmda_2_3 PMDA: ./pmdas/broken/broken_pmda_2_3 -D47104 -l logfile
dbpmda> status

Namespace:              (default)
PMDA:                   ./pmdas/broken/broken_pmda_2_3
Connection:             daemon
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> close
dbpmda> quit
Log started

broken pmda Critical: pmdaInit: PMDA broken_pmda_2_3: nmetrics (-1) should be non-negative
broken pmda Debug: pmdaConnect: PMDA broken_pmda_2_3: opened pipe to pmcd, infd = 0, outfd = 1
broken pmda Error: PMDA Initialisation Failed

Log finished
dbpmda> open pipe pmdas/broken/broken_pmda_2_4 -D47104 -l logfile
Start broken_pmda_2_4 PMDA: ./pmdas/broken/broken_pmda_2_4 -D47104 -l logfile
dbpmda> status

Namespace:              (default)
PMDA:                   ./pmdas/broken/broken_pmda_2_4
Connection:             daemon
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> text broken.valid.one
PMID: 249.0.0
[calls to fetch callback]
The number of calls to the PMDA-supplied fetch callback function.
dbpmda> close
dbpmda> quit
Log started

broken pmda Debug: pmdaInit: PMDA broken_pmda_2_4: Metric 0.0.1(1) matched to indom 249.0(0)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_4: Metric 0.0.7(3) matched to indom 249.7(1)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_4: Metric 0.0.13(8) matched to indom 249.7(1)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_4: Metric 0.0.14(12) matched to indom 249.8(2)
broken pmda Debug: pmdaInit: PMDA broken_pmda_2_4: help file pmdas/broken/broken_v2 opened
broken pmda Warning: pmdaDirect: PMDA broken_pmda_2_4: Direct mapping for metrics disabled @ metrics[2] 249.0.5
broken pmda Info: name        = broken_pmda_2_4
broken pmda Info: domain      = 249
broken pmda Info: ext flags  = 4
broken pmda Info: num metrics = 13
broken pmda Info: num indom   = 3
broken pmda Debug: pmdaConnect: PMDA broken_pmda_2_4: opened pipe to pmcd, infd = 0, outfd = 1
broken pmda Debug: Received PDU_TEXT_REQ
broken pmda Debug: Received PDU_TEXT_REQ

Log finished
dbpmda> open pipe pmdas/broken/broken_pmda_2_5 -D47104 -l logfile
[DATE] broken_pmda_2_5(PID) Critical: __pmdaSetup: broken_pmda_2_5 PMDA: interface version 77 not supported (domain=249)
pmdaDaemon() failed!
pmdaversion: expecting PDU_CREDS, got PDU type 0
Warning: no version exchange with PMDA ./pmdas/broken/broken_pmda_2_5
Start broken_pmda_2_5 PMDA: ./pmdas/broken/broken_pmda_2_5 -D47104 -l logfile
dbpmda> status

Namespace:              (default)
PMDA:                   ./pmdas/broken/broken_pmda_2_5
Connection:             daemon
PMDA PMAPI Version:     unknown!
Debug options:          (none)
Timer:                  off
Getdesc:                off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> text broken.valid.one
PMID: 249.0.0
Error: __pmSendTextReq() failed: [PMDA died]
Error: __pmSendTextReq() failed: [PMDA died]
dbpmda> close
dbpmda> quit
Culling the Performance Metrics Name Space ...
broken ... done
Updating the PMCD control file, and notifying PMCD ...
Removing files ...
Check broken metrics have gone away ... OK
