QA output created by 721
.
dbpmda> debug AUTH
dbpmda> open pipe pmdasample -l TMP.log -D AUTH
Start pmdasample PMDA: ./pmdasample -l TMP.log -D AUTH
dbpmda> attr
attr name [value]
attr attr# [value]
dbpmda> attr 5 "pcpqa"
Attribute: username=pcpqa
Success
dbpmda> attr "username" "pcpqa"
Attribute: username=pcpqa
Success
dbpmda> attr 0 "no-such-attr"
              ^ at or near here
Error: Attribute (0) is not recognised
Type 'help' for a list of commands.
dbpmda> attr "no-such-attr"
                          ^ at or near here
Error: Attribute (no-such-attr) is not recognised
Type 'help' for a list of commands.
dbpmda> 
Checking log file, pipe mode
[DATETIME] pmdasample(PID) Info: Attribute: ctx=0 username=pcpqa
[DATETIME] pmdasample(PID) Info: Attribute: ctx=0 username=pcpqa
.
dbpmda> debug AUTH
dbpmda> open dso pmda_sample.DSO sample_init
dbpmda> attr
attr name [value]
attr attr# [value]
dbpmda> attr 5 "pcpqa"
Attribute: username=pcpqa
[DATETIME] dbpmda(PID) Info: Attribute: ctx=0 username=pcpqa
Success
dbpmda> attr "username" "pcpqa"
Attribute: username=pcpqa
[DATETIME] dbpmda(PID) Info: Attribute: ctx=0 username=pcpqa
Success
dbpmda> attr 0 "no-such-attr"
              ^ at or near here
Error: Attribute (0) is not recognised
Type 'help' for a list of commands.
dbpmda> attr "no-such-attr"
                          ^ at or near here
Error: Attribute (no-such-attr) is not recognised
Type 'help' for a list of commands.
dbpmda> 
