QA output created by 955
=== Daemon PMDA linux static text then dynamic fetch test ===
dbpmda> open pipe PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
Start pmdalinux PMDA: PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
dbpmda> text hinv.ncpu
PMID: 60.0.32
[number of CPUs in the system]
<no help text specified>
dbpmda> fetch kernel.percpu.interrupts.line1
PMID(s): 60.49.1
pmResult dump from ADDR timestamp: 0.000000 TIME numpmid: 1
  60.49.1 (<noname>): numval: 8 valfmt: 0 vlist[]:
    inst [0 or ???] value 10 1.4012985e-44 ADDR
    inst [1 or ???] value 11 1.5414283e-44 ADDR
    inst [2 or ???] value 7 9.8090893e-45 ADDR
    inst [3 or ???] value 5 7.0064923e-45 ADDR
    inst [4 or ???] value 2 2.8025969e-45 ADDR
    inst [5 or ???] value 7 9.8090893e-45 ADDR
    inst [6 or ???] value 2 2.8025969e-45 ADDR
    inst [7 or ???] value 1 1.4012985e-45 ADDR
dbpmda> 
=== Daemon PMDA linux static fetch then dynamic fetch test ===
dbpmda> open pipe PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
Start pmdalinux PMDA: PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
dbpmda> fetch hinv.ncpu
PMID(s): 60.0.32
pmResult dump from ADDR timestamp: 0.000000 TIME numpmid: 1
  60.0.32 (hinv.ncpu): numval: 1 valfmt: 0 vlist[]:
   value 8 1.1210388e-44 ADDR
dbpmda> fetch kernel.percpu.interrupts.line1
PMID(s): 60.49.1
pmResult dump from ADDR timestamp: 0.000000 TIME numpmid: 1
  60.49.1 (<noname>): numval: 8 valfmt: 0 vlist[]:
    inst [0 or ???] value 10 1.4012985e-44 ADDR
    inst [1 or ???] value 11 1.5414283e-44 ADDR
    inst [2 or ???] value 7 9.8090893e-45 ADDR
    inst [3 or ???] value 5 7.0064923e-45 ADDR
    inst [4 or ???] value 2 2.8025969e-45 ADDR
    inst [5 or ???] value 7 9.8090893e-45 ADDR
    inst [6 or ???] value 2 2.8025969e-45 ADDR
    inst [7 or ???] value 1 1.4012985e-45 ADDR
dbpmda> 
=== Daemon PMDA linux dynamic then static fetch test ===
dbpmda> open pipe PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
Start pmdalinux PMDA: PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
dbpmda> fetch kernel.percpu.interrupts.line1
PMID(s): 60.49.1
pmResult dump from ADDR timestamp: 0.000000 TIME numpmid: 1
  60.49.1 (<noname>): numval: 8 valfmt: 0 vlist[]:
    inst [0 or ???] value 10 1.4012985e-44 ADDR
    inst [1 or ???] value 11 1.5414283e-44 ADDR
    inst [2 or ???] value 7 9.8090893e-45 ADDR
    inst [3 or ???] value 5 7.0064923e-45 ADDR
    inst [4 or ???] value 2 2.8025969e-45 ADDR
    inst [5 or ???] value 7 9.8090893e-45 ADDR
    inst [6 or ???] value 2 2.8025969e-45 ADDR
    inst [7 or ???] value 1 1.4012985e-45 ADDR
dbpmda> fetch hinv.ncpu
PMID(s): 60.0.32
pmResult dump from ADDR timestamp: 0.000000 TIME numpmid: 1
  60.0.32 (hinv.ncpu): numval: 1 valfmt: 0 vlist[]:
   value 8 1.1210388e-44 ADDR
dbpmda> 
=== Daemon PMDA linux look for dynamic children ===
LEAFS OK
=== Daemon PMDA fetch from a second dynamic metric tree ===
dbpmda> open pipe PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
Start pmdalinux PMDA: PCP_PMDAS_DIR/linux/pmdalinux -d 60 -l TMP.log
dbpmda> fetch kernel.percpu.softirqs.NET_RX kernel.percpu.interrupts.line0
PMID(s): 60.63.3 60.49.0
pmResult dump from ADDR timestamp: 0.000000 TIME numpmid: 2
  60.63.3 (<noname>): numval: 8 valfmt: 0 vlist[]:
    inst [0 or ???] value 2452582 3.4367994e-39 ADDR
    inst [1 or ???] value 469315 6.5765039e-40 ADDR
    inst [2 or ???] value 398117 5.5788074e-40 ADDR
    inst [3 or ???] value 408351 5.7222163e-40 ADDR
    inst [4 or ???] value 383922 5.3798931e-40 ADDR
    inst [5 or ???] value 438586 6.1458989e-40 ADDR
    inst [6 or ???] value 440370 6.170898e-40 ADDR
    inst [7 or ???] value 326415 4.5740484e-40 ADDR
  60.49.0 (<noname>): numval: 8 valfmt: 0 vlist[]:
    inst [0 or ???] value 38 5.3249342e-44 ADDR
    inst [1 or ???] value 0 0 ADDR
    inst [2 or ???] value 0 0 ADDR
    inst [3 or ???] value 0 0 ADDR
    inst [4 or ???] value 0 0 ADDR
    inst [5 or ???] value 0 0 ADDR
    inst [6 or ???] value 0 0 ADDR
    inst [7 or ???] value 0 0 ADDR
dbpmda> 
